OpenNuvoton/M2351BSP/SampleCode/StdDriver/USBD_Audio_Codec/usbd_audio.c
        /* Reset some variables */
        g_u32BufPlayIdx = 0;
        g_u32PlayBufPos = 0;
        g_u8PDMATxIdx = 0;
        g_u8AudioPlaying = 0;
        g_u8TxDataCntInBuffer = 0;

        /* flush PCM buffer */
        memset(g_au32PcmPlayBuff, 0, sizeof(g_au32PcmPlayBuff));
        TIMER0->CNT = 0x7657;

    }
    else
    {
        /* Disable record hardware/stop record */
        g_u8RecEn = 0;
        /* Disable I2S Rx function */
        I2S_DISABLE_RXDMA(I2S0);
        I2S_DISABLE_RX(I2S0);

        /* Disable PDMA channel */
        PDMA0->PAUSE |= (1 << PDMA_I2S_RX_CH);
        printf("Stop Record ..\n");

        /* Reset some variables */
        g_u32BufRecIdx = 0;
        g_u8PDMARxIdx = 0;

        /* flush PCM buffer */
        memset(g_au8PcmRxBufFull, 0, sizeof(g_au8PcmRxBufFull));
    }
}


/**
  * @brief  GetPlayData, To get data from ISO OUT to play buffer.
  * @param  pi16src: The data buffer of ISO OUT.
  *         i16Samples: The sample number in data buffer.
  * @retval None.
  */
void UAC_GetPlayData(uint8_t *pu8Src, uint32_t u32Samples)
{
    uint32_t i, u32len;
    uint32_t *pu32Buff;
    uint32_t *pu32Src;

    /* if buffer has enough data, play it!! */
    if(!g_u8AudioPlaying && (g_u8TxDataCntInBuffer >= (PDMA_TXBUFFER_CNT / 2 + 1)))
    {
        AudioStartPlay(g_usbd_SampleRate);
        g_u8AudioPlaying = 1;
    }

    u32len = u32Samples / 4;
    /* Ring buffer check */
    if((g_u32PlayBufPos + u32len) > g_u32BuffLen)
    {
        g_au32PcmPlayBuffLen[g_u32BufPlayIdx] = g_u32PlayBufPos;
        g_u32PlayBufPos = 0;
        g_u32BufPlayIdx ++;

        /* change buffer index */
        if(g_u32BufPlayIdx >= PDMA_TXBUFFER_CNT)
            g_u32BufPlayIdx = 0;

        /* increase data count in buffer */
        g_u8TxDataCntInBuffer ++;
    }

    pu32Buff = &g_au32PcmPlayBuff[g_u32BufPlayIdx][g_u32PlayBufPos];
    pu32Src = (uint32_t *) pu8Src;
    for(i = 0; i < u32len; i++)
    {
        pu32Buff[i] = pu32Src[i];
    }

    g_u32PlayBufPos += u32len;
}



void AudioStartPlay(uint32_t u32SampleRate)
{
    UAC_DeviceEnable(1);

    /* Configure TX PDMA SG table */
    PDMA_WriteTxSGTable();

    /* Configure codec to specific sample rate */
#if NAU8822
    NAU8822_ConfigSampleRate(u32SampleRate);
#else
    NAU88L25_ConfigSampleRate(u32SampleRate);
#endif

    /* Enable I2S Tx function */
    I2S_ENABLE_TXDMA(I2S0);
    I2S_ENABLE_TX(I2S0);

    /* Enable PDMA channel */
    PDMA0->CHCTL |= (1 << PDMA_I2S_TX_CH);
    printf("Start Play ... \n");

    // workaround for PDMA suspend
    PDMA0->DSCT[PDMA_I2S_TX_CH].CTL = 0;
    PDMA0->DSCT[PDMA_I2S_TX_CH].CTL = 2;
}


/**
  * @brief  SendRecData, prepare the record data for next ISO transfer.
  * @param  None.
  * @retval None.
  */
void UAC_SendRecData(void)
{
    /* When record buffer full, send data to host */
    if(g_au8PcmRxBufFull[g_u32BufRecIdx])
    {
        /* Set empty flag */
        g_au8PcmRxBufFull[g_u32BufRecIdx] = 0;

        USBD_MemCopy((uint8_t *)((uint32_t)USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2)), (void *)&g_au8PcmRecBuff[g_u32BufRecIdx][0], g_u32RxBuffLen);
        USBD_SET_PAYLOAD_LEN(EP2, g_u32RxBuffLen);

        /* Change to next PCM buffer */
        g_u32BufRecIdx ++;
        if(g_u32BufRecIdx >= PDMA_RXBUFFER_CNT)
            g_u32BufRecIdx = 0;

    }
    else
    {
        USBD_SET_PAYLOAD_LEN(EP2, 0);
    }
}

void AudioStartRecord(uint32_t u32SampleRate)
{
    /* Configure RX PDMA SG table */
    PDMA_WriteRxSGTable();

    /* Configure codec to specific sample rate */
#if NAU8822
    NAU8822_ConfigSampleRate(u32SampleRate);
#else
    NAU88L25_ConfigSampleRate(u32SampleRate);
#endif

    /* Enable I2S Tx function */
    I2S_ENABLE_RXDMA(I2S0);
    I2S_ENABLE_RX(I2S0);

    /* Enable PDMA channel */
    PDMA0->CHCTL |= (1 << PDMA_I2S_RX_CH);
    printf("Start Record ... \n");

    PDMA0->DSCT[PDMA_I2S_RX_CH].CTL = 0;
    PDMA0->DSCT[PDMA_I2S_RX_CH].CTL = 2;
}


//======================================================
void TMR0_IRQHandler(void)
{
    TIMER_ClearIntFlag(TIMER0);

    if(g_u8PlayEn)
    {
        if((g_u8TxDataCntInBuffer >= (PDMA_TXBUFFER_CNT / 2)) && (g_u8TxDataCntInBuffer <= (PDMA_TXBUFFER_CNT / 2 + 1)))
            AdjustCodecPll(E_RS_NONE);
        else if(g_u8TxDataCntInBuffer >= (PDMA_TXBUFFER_CNT - 2))
            AdjustCodecPll(E_RS_UP);
        else
            AdjustCodecPll(E_RS_DOWN);
    }
}




